In [1]:
1+1

2

In [2]:
5/3

1.6666666666666667

In [4]:
import pandas as pd

In [4]:
data = pd.Series([575,409,243,642,45,470,248,244,40,165])

In [5]:
data

0    575
1    409
2    243
3    642
4     45
5    470
6    248
7    244
8     40
9    165
dtype: int64

In [26]:
data.var()

43628.100000000006

In [9]:
#install any packages
!pip install pandas

Requirement already satisfied: pandas in c:\users\welcome\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\welcome\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\welcome\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\welcome\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\welcome\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [5]:
df =  pd.read_csv("datasets/salaries.csv")

In [29]:
df.head(2)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000

In [28]:
df.tail(2)

    rank discipline  phd  service     sex  salary
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646

In [30]:
#dataframe attributs
#df.attribute
#dtypes
#values
#shape
#columns
#ndim
#size
#axes
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [31]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [32]:
df.size

468

In [34]:
#df.values
df.axes

[RangeIndex(start=0, stop=78, step=1),
 Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')]

In [36]:
df.shape

(78, 6)

In [1]:
#DataFrame Methods
#Unlike attributes, python methods have parenthesis
#All attributes nad methods can be listed with dir: dir(df)

In [6]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [8]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [9]:
df.phd.mean()

19.705128205128204

In [10]:
df.salary.mean()

108023.78205128205

In [11]:
df.service.mean()

15.051282051282051

In [14]:
df[["phd","salary","service"]].std()

phd           12.498425
salary     28293.661022
service       12.139768
dtype: float64

In [16]:
df[["phd","salary","service"]].head(50).mean()

phd            21.52
salary     113789.14
service        17.60
dtype: float64

In [17]:
df[["phd","salary","service"]].mean()

phd            19.705128
salary     108023.782051
service        15.051282
dtype: float64

In [18]:
df.phd.describe()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [19]:
df.phd.count()

78

In [22]:
round(df.phd.mean(),3)

19.705

In [31]:
df_rank = df.groupby(["rank"],sort = False)

In [32]:
#Data Frame groupby Method
df_rank[["phd","service","salary"]].mean()

                 phd    service         salary
rank
Prof       27.065217  21.413043  123624.804348
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474

In [34]:
df.salary.count()

78

In [41]:
df.salary[df.salary > 100000]

0     186960
2     110515
3     131205
4     104800
5     122400
7     126300
10    128250
11    134778
13    162200
14    153750
15    150480
18    107300
19    150500
21    103106
26    148750
27    155865
29    123683
30    107008
31    155750
32    103275
33    120000
34    119800
35    126933
36    146856
37    102000
39    129000
40    137000
44    151768
45    140096
47    103613
48    111512
49    122960
51    127512
52    105000
58    144651
59    103994
61    103750
62    109650
65    117555
69    116450
72    161101
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, dtype: int64

In [40]:
#Data Frame Silicing :- iloc
# df.iloc[rows,columns]
# df.iloc[start:stop,start:stop]

In [47]:
#df.iloc[0]
# df.iloc[5]
# df.iloc[-1]

rank            Prof
discipline         A
phd               23
service           15
sex           Female
salary        109646
Name: 77, dtype: object

In [48]:
df.iloc[1:7,:]

        rank discipline  phd  service   sex  salary
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [49]:
df.iloc[0:2,[2,3,5]]

   phd  service  salary
0   56       49  186960
1   12        6   93000

In [58]:
# df.iloc[:9,:3]
# df.iloc[:,4:6]
# df.iloc[[59]]
# df.iloc[[0,2]]

         rank discipline  phd  service     sex  salary
59  AssocProf          B   12       10  Female  103994

In [59]:
#Aggregation Functions
#mean,max,min,count,median,mode,prod,mode,var,std
#Aggregate Functions are useful when multiple statistic are computed per column
#agg()

In [61]:
df[["phd","salary"]].agg(["max","mean","min"])

            phd         salary
max   56.000000  186960.000000
mean  19.705128  108023.782051
min    1.000000   57800.000000

In [63]:
df[["salary"]].skew()

salary    0.452103
dtype: float64

In [64]:
df.salary.kurt()

-0.4017126758820546